Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON_EN>FR.tmx
Source language: en
Languages: fr_fr

source: YOU DON’T EVEN KNOW ME!
fr_fr: VOUS NE ME CONNAISSEZ PAS !

source: ALRIGHT.
fr_fr: BON.

source: IS BETTER SUITED TO SOMEONE AS PRETTY AS YOU, SHARON...
fr_fr: IRAIT BIEN MIEUX AVEC UNE JOLIE FILLE COMME TOI, SHARON...

source: I WILL MAKE SURE TO PASS IT ALONG TO CYNTHIA.
fr_fr: JE LA DONNERAI À CYNTHIA.

source: OH, DIRECTOR HAN SAID THE DOCUMENT NEEDS PROMPT APPROVAL.
fr_fr: OH, LE DIRECTEUR HAN A BESOIN DE VOTRE ACCORD RAPIDEMENT.

source: MY WORK FOLLOW ME EVEN TO BED.
fr_fr: LE TRAVAIL ME POURSUIT JUSQUE DANS MON LIT.

source: GRIP
fr_fr: SERRE

source: SWISH
fr_fr: FLAP

source: NOW I NEED YOU TO SIGN.
fr_fr: C’EST À TOI DE SIGNER, MAINTENANT.

source: WHAT...?
fr_fr: COMMENT...?

source: AH, MADAM...
fr_fr: OH, MADAME...

source: MY DEPARTMENT STORE WAS ON THE FRONT PAGE OF THE NEWSPAPER.
fr_fr: MON GRAND MAGASIN A FAIT LA UNE DU JOURNAL.

source: PLOP
fr_fr: PLOC

source: WAIT.
fr_fr: ATTENDS.

source: SORRY, I KNOW I CHOSE THIS PLACE, BUT I DON'T HAVE AN APPETITE...
fr_fr: DÉSOLÉE. J’AI CHOISI CET ENDROIT, MAIS JE N’AI PAS FAIM.

source: I WAS REINCARNATED AS THE YOUNGER SISTER OF THE HERO, THEODORE CRESCENTE!
fr_fr: JE ME SUIS RÉINCARNÉE DANS LA PEAU DE LA PETITE SŒUR DE THEODORE CRESCENTE !

source: ENGLISH SCRIPT BY:
fr_fr: TEXTE ANGLAIS PAR :

source: I HAVE YOU.
fr_fr: JE VOUS AI, VOUS.

source: H-HEY… COULD WE JUST GET GOING WITHOUT THEM?
fr_fr: BON... ET SI ON PARTAIT SANS EUX ?

source: I’M SURE THE TOP BRASS WOULD FEEL INCLINED TO PRESSURE US TO KEEP THE HEAT OFF THE GUY.
fr_fr: JE SUIS SÛR QUE LES HAUTS GRADÉS SERAIENT PRÊTS À FAIRE PRESSION SUR NOUS POUR LE PROTÉGER.

source: PEOPLE THINK I HAVE A WHOLE CASTLE, BUT IT’S JUST A GIANT OFFICE!
fr_fr: J’AI BEAU AVOIR UN CHÂTEAU, CE N’EST QU’UN BUREAU GÉANT !

source: THAT’S IT, DAMN IT!
fr_fr: ÇA SUFFIT, À LA FIN !

source: SLIDE
fr_fr: FFFT

source: YOU’RE THE ONLY ONE THROWING A TANTRUM HERE.
fr_fr: IL N’Y A QUE VOUS QUI PIQUEZ UNE CRISE.

source: HMPH, WHAT A STURDY GIRL SHE IS~
fr_fr: MMH, ELLE EST CORIACE, CELLE-LÀ.

source: O-OKAY…
fr_fr: D-D’ACCORD.

source: EVERYONE ELSE IS WELCOME TO TAG ALONG.
fr_fr: LES AUTRES, VOUS POUVEZ M’ACCOMPAGNER.

source: PEEKABOO!
fr_fr: COUCOU !

source: HAIR, CHECK...
fr_fr: LA COIFFURE, C’EST BON...

source: GULP
fr_fr: GLOUPS

source: YOUR MAJESTY!
fr_fr: VOTRE MAJESTÉ !

source: MY STEPMOTHER AND STEPSISTER, SHARON, HAVE DEFINITELY BEEN HARASSING ME UP TO THIS POINT.
fr_fr: MA BELLE-MÈRE ET SHARON, MA DEMI-SŒUR, ME HARCELAIENT. ÇA, C’EST CERTAIN.

source: THOUGH, I DON'T HAVE ANY INTENTION OF MARRYING...!
fr_fr: MAIS JE N’AI NULLEMENT L’INTENTION DE ME MARIER...!

source: TO BE CONTINUED
fr_fr: À SUIVRE

source: THEN, I WILL TAKE MY LEAVE.
fr_fr: BIEN, JE VAIS PRENDRE CONGÉ.

source: SERIOUSLY...
fr_fr: SÉRIEUSEMENT...

source: WHAT'S GOTTEN INTO YOU?
fr_fr: QU’EST-CE QUI TE PREND ?

source: UNLIKE WHAT THE RUMORS SAID, HE WASN'T RUDE OR ECCENTRIC.
fr_fr: CONTRAIREMENT À CE QUE DISAIT LA RUMEUR, IL N’ÉTAIT NI GROSSIER NI BIZARRE.

source: IT’S LUDICROUS!
fr_fr: C’EST INSENSÉ !

source: WE’RE HERE TO TAKE OVER THIS CASE.
fr_fr: NOUS REPRENONS L’AFFAIRE.

source: I AM THE ELDEST DAUGHTER OF THE CRESCENTE DUCHY, ADRIANNA CRESCENTE, YOUR MAJESTY.
fr_fr: JE SUIS ADRIANNA CRESCENTE, FILLE AÎNÉE DU DUC DE CRESCENTE, VOTRE MAJESTÉ.

source: Jade Law
fr_fr: Deborah Martin

source: I DON'T WANT TO GO…INTO THAT F-FOREST!
fr_fr: JE NE VEUX PAS ALLER... DANS CETTE F-FORÊT !

source: RUB
fr_fr: SCRACTH

source: I DON'T LIKE THE KITCHEN COUNTER.
fr_fr: JE N’AIME PAS LE PLAN DE TRAVAIL DANS LA CUISINE.

source: IF IT WERE ANYONE ELSE, CHANCELLOR, YOU’D HAVE BEEN SENT TO THE STOCKS.
fr_fr: SI CE N’ÉTAIT PAS VOUS, CHANCELIER, ON VOUS AURAIT MIS AU PILORI.

source: DETECTIVE JUNG.
fr_fr: INSPECTEUR JUNG.

source: IT'LL GIVE ME INDIGESTION!
fr_fr: ÇA ME DONNERA UNE INDIGESTION !

source: SO A DETECTIVE SHOULDN’T TAKE THIS PERSONALLY, HUH…
fr_fr: UN INSPECTEUR NE DEVRAIT PAS S’IMPLIQUER PERSONNELLEMENT, HEIN ?

source: DASH
fr_fr: FILE

source: THAT PREVIOUS ME...
fr_fr: CETTE MOI DU PASSÉ...

source: IT'S NOT THAT...
fr_fr: CE N’EST PAS ÇA...

source: I SEE THE BODY’S STILL HERE.
fr_fr: LE CORPS EST ENCORE LÀ.

source: DRESS...
fr_fr: LA ROBE...

source: BECAUSE I DREAM OF A HEALTHY, WEALTHY, AND LONG LIFE!
fr_fr: CAR JE RÊVE DE VIVRE RICHE, LONGTEMPS ET EN BONNE SANTÉ !

source: THEY SENT MY OLDER BROTHER TO BOARDING SCHOOL, AND HAVE TORMENTED ME EVER SINCE.
fr_fr: ELLES ONT ENVOYÉ MON GRAND FRÈRE EN PENSIONNAT ET N’ONT CESSÉ DE ME PERSÉCUTER.

source: HNGH… MMF…
fr_fr: GNNN... ARGH...

source: ACK!
fr_fr: AÏE !

source: LIFE WITH A SILVER SPOON TASTES SO SWEET!
fr_fr: ÊTRE FILLE DE BONNE FAMILLE, C’EST SI BON !

source: I HAD A CHANCE TO ASK EARLIER…
fr_fr: J’AI PU ME RENSEIGNER...

source: SO WHY DOES THE FIRST LADY OF BEDCHAMBER KICK ME EVERY MORNING?
fr_fr: ALORS, POURQUOI MA DAME DE COMPAGNIE ME MALMÈNE-T-ELLE TOUS LES MATINS ?

source: UGH...
fr_fr: RHOO...

source: H-HOWEVER-
fr_fr: TOUTEFOIS...

source: YOU’RE EVIL.
fr_fr: C’EST MÉCHANT.

source: IT SLIPPED MY MIND, WHILE WE WERE INSIDE, SO I DIDN'T GIVE IT TO YOU THEN...
fr_fr: ÇA M’ÉTAIT SORTI DE LA TÊTE QUAND NOUS ÉTIONS DANS LA MAISON. J’AI OUBLIÉ DE VOUS DONNER CECI...

source: LOCALIZATION MANAGER:
fr_fr: CHARGÉ DE PROJET DE TRADUCTION :

source: NOPE.
fr_fr: NON.

source: HM...
fr_fr: MMH...

source: HE SEEMS LIKE HE’S GOT A LONG PROMISING CAREER AHEAD OF HIM.
fr_fr: IL A L’AIR D’ÊTRE PROMIS À UNE GRANDE ET BRILLANTE CARRIÈRE.

source: WAS CROWNED RULER BEFORE THE DEAFENING ROAR OF THE ADORING POPULACE.
fr_fr: FUT COURONNÉE SOUVERAINE DEVANT LE PEUPLE EN LIESSE.

source: IT CAN'T BE HELPED...
fr_fr: JE N’Y PEUX RIEN...

source: AS SHE HEARD HER PHONE GO OFF FOR FIVE MINUTES…
fr_fr: SON TÉLÉPHONE A SONNÉ PENDANT CINQ MINUTES.

source: SINCE MY STEPMOTHER HASN'T HAD A NEW DRESS MADE FOR ME IN YEARS~
fr_fr: ÇA FAIT DES ANNÉES QUE MA BELLE-MÈRE NE M’A PAS ACHETÉ DE ROBE~

source: TP
fr_fr: TAP

source: JUST A CHOKE, MA’AM.
fr_fr: À PERDRE HALEINE.

source: THWACK
fr_fr: PAF

source: PRESIDENT CHOI, WOULD YOU LIKE TO TAKE YOUR LUNCH NOW?
fr_fr: MONSIEUR LE PRÉSIDENT, SOUHAITEZ-VOUS PRENDRE VOTRE DÉJEUNER ?

source: YOU ARE REALLY UNCOUTH.
fr_fr: TU ES D’UNE GROSSIÈRETÉ.

source: ...YES.
fr_fr: ...OUI.

source: RIAN, WHY DID YOU RUN AFTER THE PRINCE?
fr_fr: RIAN, POURQUOI AS-TU COURU APRÈS LE PRINCE ?

source: Secondary Quality Control:
fr_fr: Second contrôle qualité :

source: DETECTIVE KIM, PLEASE HAND OVER THIS CASE TO US!
fr_fr: INSPECTEUR KIM, VEUILLEZ NOUS REMETTRE L’AFFAIRE !

source: Alex Culang
fr_fr: Emilia Mondino

source: I WAKE UP AT THE CRACK OF DAWN FOR MEETINGS BEFORE AND AFTER BREAKFAST!
fr_fr: JE ME LÈVE À L’AUBE POUR ASSISTER À DES RÉUNIONS AVANT MÊME LE PETIT-DÉJEUNER !

source: JUMP
fr_fr: HOP

source: THEY LOOK HAPPY...
fr_fr: ILS ONT L’AIR HEUREUX...

source: THE PEERLESS BEAUTY,
fr_fr: BEAUTÉ INÉGALÉE,

source: PLAYER KIM SOOHYUN?
fr_fr: JOUEUR KIM SOOHYUN ?

source: FROM NOW ON, YOU'LL COME DOWN TO TAKE YOUR MEALS, AT MEALTIME, IN THE DINING ROOM.
fr_fr: DÉSORMAIS, TU PRENDRAS TES REPAS AVEC NOUS À LA SALLE À MANGER.

source: THIS IS...!
fr_fr: C’EST...!

source: RECONFIRMING PLAYER KIM SOOHYUN’S REQUEST.
fr_fr: CONFIRMER LA DEMANDE DU JOUEUR KIM SOOHYUN.

source: T-THAT’S RIGHT.
fr_fr: C’EST VRAI.

source: I WILL CALL UPON YOU AGAIN.
fr_fr: JE REVIENDRAI VOUS VOIR.

source: THEY WHY DID YOU CALL HER SIX TIMES?
fr_fr: ALORS POURQUOI L’AVEZ-VOUS APPELÉE ?

source: FWUP
fr_fr: PAF

source: I'M CERTAIN I DIED THAT DAY.
fr_fr: JE SUIS CERTAINE D’ÊTRE MORTE CE JOUR-LÀ.

source: THE HAIR PIN?
fr_fr: LA BARRETTE ?

source: Feel Better
fr_fr: Guérison

source: OH, THAT?
fr_fr: OH, ÇA ?

source: THIS...
fr_fr: JE...

source: GLUG
fr_fr: GLOU

source: MISS RIAN!
fr_fr: MADEMOISELLE RIAN !

source: I DON’T WANT TO!
fr_fr: JE NE VEUX PAS !

source: YOU WERE GOING TO MEET...
fr_fr: QUE TU DEVAIS RENCONTRER...

source: I HAVE NO SPACE OF MY OWN!
fr_fr: JE N’AI PAS D’ESPACE PRIVÉ !

source: WHY ARE YOU HERE?
fr_fr: QUE FAITES-VOUS ICI ?

source: STEP
fr_fr: TAP

source: THE DETECTIVES WENT OUT TO THE SUSPECTED CRIME SCENE IMMEDIATELY.
fr_fr: LES INSPECTEURS SE SONT IMMÉDIATEMENT RENDUS SUR LES LIEUX.

source: HOW COULD I EVEN DARE?!
fr_fr: COMMENT OSERAIS-JE ?!

source: GET...
fr_fr: VEUX...

source: FOR THE SAKE OF MY BLESSED LIFE WITH A SILVER SPOON!
fr_fr: C’EST DANS L’INTÉRÊT DE MA MERVEILLEUSE VIE DE FILLE DE BONNE FAMILLE !

source: SHINE
fr_fr: PÉTILLE

source: UM…
fr_fr: MMH...

source: THE LAST FOCAL COLOR WAS BETTER.
fr_fr: JE PRÉFÉRAIS LA COULEUR PRÉCÉDENTE.

source: AND THEN I SAW THAT AN IMPORTANT GUEST HAD ARRIVED, SO I CAME IN TO GIVE MY GREETINGS.
fr_fr: ET J’AI VU QUE NOUS AVIONS UN INVITÉ DE MARQUE, ALORS JE SUIS VENUE LE SALUER.

source: WHAT GOOD DOES THAT DO…
fr_fr: QU’EST-CE QUE ÇA PEUT FAIRE...

source: BUMP
fr_fr: PAF

source: YOU CAN’T SIT HERE LIKE THIS.
fr_fr: NE RESTE PAS LÀ.

source: I HAVE TO FIGURE OUT MY CURRENT SITUATION.
fr_fr: IL FAUT QUE JE COMPRENNE CE QUI M’ARRIVE.

source: W-WAIT FOR ME…
fr_fr: A-ATTENDS-MOI...

source: YEAH, JUST LEAVE THEM BEHIND.
fr_fr: OUI, LAISSONS-LES.

source: ORIGINAL NOVEL BY:
fr_fr: UN ROMAN ORIGINAL DE :

source: ACTUALLY, YOU’RE THE ONE MAKING ME NERVOUS FIDGETING AROUND WITH THAT CROSSBOW IN FRONT OF EVERYONE HERE.
fr_fr: EN FAIT, C’EST VOUS QUI ME STRESSEZ À FORCE D’AGITER CETTE ARBALÈTE DEVANT TOUT LE MONDE.

source: LEAP
fr_fr: BONDIT

source: I’M SORRY!
fr_fr: JE SUIS DÉSOLÉE !

source: BUSTLE
fr_fr: BROUHAHA

source: BASED ON THAT “FEELING” YOU’VE GOT…
fr_fr: À CAUSE DE CETTE « SENSATION »...

source: BUT IF I SAY NO?
fr_fr: ET SI JE REFUSE ?

source: THE DINING ROOM?
fr_fr: LA SALLE À MANGER ?

source: YOU KNOW I'M BUSY, SO LET'S GET TO THE POINT.
fr_fr: JE SUIS OCCUPÉ, TU LE SAIS. ALLONS DROIT AU BUT.

source: WHAT CAN I DO?
fr_fr: QU’EST-CE QUE J’Y PEUX ?

source: IT'S TOMATO JUICE WITH HONEY, GOOD FOR HEARTBURN.
fr_fr: C’EST DU JUS DE TOMATE AU MIEL. C’EST BON POUR LES BRÛLURES D’ESTOMAC.

source: LET'S GET DIVORCED.
fr_fr: JE VEUX DIVORCER.

source: QUIET, SHARON!
fr_fr: DU CALME, SHARON !

source: HOW DO YOU DO?
fr_fr: ENCHANTÉ.

source: I WILL NO LONGER LIVE AS A VICTIM!
fr_fr: JE NE SERAI PLUS UNE VICTIME !

source: I DIDN'T DO ANYTHING.
fr_fr: JE N’AI RIEN FAIT.

source: YOU LISTENING?
fr_fr: TU M’ÉCOUTES ?

source: SIGH
fr_fr: SOUPIR

source: TRANSLATION TEAM LEAD:
fr_fr: RESPONSABLE DE L’ÉQUIPE TRADUCTION :

source: Cherisse Yanit Nadal
fr_fr: Glocalize

source: DON’T MIND ME.
fr_fr: NE VOUS OCCUPEZ PAS DE MOI.

source: AND YOUR SECOND SON, RUDOLPH, IS STILL VERY YOUNG.
fr_fr: ET VOTRE SECOND FILS, RUDOLPH, EST ENCORE TRÈS JEUNE.

source: TUK
fr_fr: CLAC

source: I BESEECH YOU TO RECONSIDER!
fr_fr: RÉFLÉCHISSEZ-Y, JE VOUS EN CONJURE !

source: CR-CROWN PRINCESS...!
fr_fr: LA... LA PRINCESSE HÉRITIÈRE...!

source: KRRR
fr_fr: GRRR

source: COUGH COUGH
fr_fr: KOF KOF

source: VERY CLEVER, SECOND PRINCE LEONHARTZ!
fr_fr: C’EST TRÈS MALIN, PRINCE LEONHARTZ !

source: INVESTIGATIONS INSTIGATED BY OFFICERS BASED ON INTELLIGENCE SUGGESTING THAT INDIVIDUALS OR ORGANIZATION MAY BE A THREAT.
fr_fr: ENQUÊTE MENÉE PAR DES AGENTS À PARTIR DE RENSEIGNEMENTS SUGGÉRANT QUE DES INDIVIDUS OU DES ORGANISATIONS PEUVENT CONSTITUER UNE MENACE.

source: GAAAH
fr_fr: GNAAA

source: GO AHEAD.
fr_fr: JE T’ÉCOUTE.

source: GENTLE..
fr_fr: DOUCEMENT...

source: WITH ALL DUE RESPECT, DON’T YOU THINK YOU’RE GETTING TOO EMOTIONALLY INVESTED IN THIS?
fr_fr: AVEC TOUT LE RESPECT QUE JE VOUS DOIS, NE VOUS IMPLIQUEZ-VOUS PAS TROP DANS CETTE AFFAIRE ?

source: ASSIGNED ON ROTATION.
fr_fr: IL EST DE SERVICE.

source: HMPH!
fr_fr: MMH !

source: IT IS A PLEASURE TO MEET YOU, LADY ADRIANNA.
fr_fr: C’EST UN PLAISIR DE VOUS RENCONTRER, LADY ADRIANNA.

source: SIP
fr_fr: SLURP

source: DO I LOOK EASY TO YOU?
fr_fr: EST-CE QUE J’AI L’AIR D’ÊTRE CONCILIANT ?

source: WE PRESENT YOU A QUEST.
fr_fr: JE VOUS CONFIE UNE MISSION.

source: I BARELY PULLED OFF FIXING UP THIS OLD DRESS THAT I WORE WHEN I WAS YOUNGER.
fr_fr: C’EST À PEINE SI J’AI PU RACCOMMODER CETTE VIEILLE ROBE QUE JE PORTAIS ÉTANT PLUS JEUNE.

source: OH FOR GOODNESS SAKE!
fr_fr: POUR L’AMOUR DU CIEL !

source: FORGET THE SLEEPING PILLS.
fr_fr: OUBLIE LES SOMNIFÈRES.

source: I WAS IN A GOOD MOOD TODAY, MOTHER, SO I TOOK A WALK IN THE GARDEN.
fr_fr: J’ÉTAIS D’HUMEUR JOYEUSE AUJOURD’HUI, MÈRE, ALORS JE SUIS ALLÉE FAIRE UN TOUR AU JARDIN.

source: DETECTIVE KIM.
fr_fr: INSPECTEUR KIM.

source: WHEN I CALLED HER THIS MORNING…
fr_fr: JE L’AI APPELÉE, CE MATIN...

source: I WAS REINCARNATED AS A CHARACTER IN A BOOK THAT MY PREVIOUS SELF LOVED TO READ!
fr_fr: JE M’ÉTAIS RÉINCARNÉE DANS LA PEAU D’UN PERSONNAGE DE ROMAN QUE MON ANCIENNE MOI ADORAIT !

source: EVERY DAY WAS FILLED WITH PAIN.
fr_fr: CHAQUE JOUR ÉTAIT UNE SOUFFRANCE.

source: AND...
fr_fr: ET...

source: MY QUEEN!
fr_fr: MA REINE !

source: OH, IS IT AN EX-GIRLFRIEND~?
fr_fr: C’EST UNE DE TES EX~ ?

source: I'M GOING TO BE HEALTHY FROM NOW ON!
fr_fr: DÈS AUJOURD’HUI, JE VIVRAI SAINEMENT.

source: YOU WILL HAVE TO BECOME MY ALLY FOR A SHORT WHILE.
fr_fr: J’AURAI BESOIN DE VOUS COMME ALLIÉ POUR UN PETIT MOMENT.

source: I DON'T WANT TO EAT WITH YOU GUYS EITHER, OK?
fr_fr: MOI NON PLUS, JE N’AI PAS ENVIE DE MANGER AVEC VOUS.

source: MCU SMPA.
fr_fr: POLICE DE SÉOUL.

source: WE'D BETTER BE GOING.
fr_fr: BIEN, CE SERA TOUT.

source: WERE THEY WAITING FOR ME?
fr_fr: M’ATTENDAIENT-ELLES ?

source: I FAIL TO COMPREHEND WHAT YOU MEAN BY THAT…
fr_fr: JE NE COMPRENDS PAS CE QUE VOUS VOULEZ DIRE...

source: THAT ALLOWED THE MEMORIES FROM MY PREVIOUS LIFE TO RESURFACE?
fr_fr: QUI A DÉBLOQUÉ TOUS CES SOUVENIRS DE MON ANCIENNE VIE ?

source: JINGLE-
fr_fr: DING-

source: SNAP
fr_fr: CLIC

source: I WAS AN ORDINARY COUNTRY GIRL WHO LIVED ON A POOR FARM.
fr_fr: J’ÉTAIS UNE PAYSANNE ORDINAIRE QUI VIVAIT DANS UNE MODESTE FERME.

source: THIS IS HOW SHE USED TO BE…
fr_fr: JADIS, ELLE SE BATTAIT...

source: YOU WOULDN'T BUDGE WHEN THE RESTRUCTURING OF THE SUNGWON CONSTRUCTION CO.
fr_fr: TU N’AS PAS BRONCHÉ QUAND LA RESTRUCTURATION DE L’ENTREPRISE SUNGWON CONSTRUTION

source: THIS IS A HAIR PIN FOR HER MAJESTY, PRINCESS CYNTHIA.
fr_fr: C’EST UNE ÉPINGLE À CHEVEUX POUR SA MAJESTÉ LA PRINCESSE CYNTHIA.

source: I KNOW IT IS CONSIDERED IMPOLITE OF ME TO ASK YOU TO DELIVER SOMETHING, YOUR HIGHNESS.
fr_fr: JE SAIS QU’IL EST IMPOLI DE VOUS DEMANDER DE FAIRE CETTE COMMISSION POUR MOI, VOTRE ALTESSE.

source: REALLY, YOUNG MISS!
fr_fr: VRAIMENT, MADEMOISELLE !

source: BRING IT HERE, IT LOOKS LIKE THEY MISPLACED RUDOLPH'S INVITATION.
fr_fr: DONNE-LA-MOI. ON DIRAIT QU’ILS ONT ÉGARÉ CELLE DE RUDOLPH.

source: Kristianna Lee
fr_fr: Glocalize

source: HE'S UPSTAIRS.
fr_fr: IL EST À L’ÉTAGE.

source: I THOUGHT IT WOULD BE BETTER IF I JUST DIED.
fr_fr: J’AURAIS PRÉFÉRÉ MOURIR.

source: CHANCELLOR.
fr_fr: CHANCELIER.

source: I HAVE TO FIND A WAY TO CHANGE MY FATE!
fr_fr: JE DOIS CHANGER LE COURS DU DESTIN !

source: WE HAVE SPOKEN.
fr_fr: J’EN AI DÉCIDÉ AINSI.

source: AND THE BEAUTIFUL LOVE STORY BETWEEN RAMONA AND THE HERO THEODORE...
fr_fr: ET CETTE BELLE HISTOIRE D’AMOUR ENTRE RAMONA ET THEODORE, LE HÉROS...

source: I WAS RIGHT...
fr_fr: J’AVAIS VU JUSTE...

source: SO PLEASE… DON’T LEAVE ME…
fr_fr: JE T’EN PRIE... NE ME LAISSE PAS...

source: I'M NOT TRYING TO ATTACK ANYONE.
fr_fr: JE NE VAIS ATTAQUER PERSONNE.

source: COME ON GET A GRIP!
fr_fr: ALLEZ, RESSAISIS-TOI !

source: SLOSH
fr_fr: GLOU GLOU

source: SPICY STIR FRIED-RICE CAKES
fr_fr: GALETTES DE RIZ SAUTÉES AUX ÉPICES

source: YOU DON'T HAVE TO SAY YES,
fr_fr: VOUS N’ÊTES PAS OBLIGÉE D’ACCEPTER.

source: I THINK IT WOULD SUIT PRINCESS CYNTHIA'S SILVER HAIR MUCH BETTER THAN MY BLACK HAIR.
fr_fr: ELLE CONVIENDRAIT BIEN MIEUX À LA CHEVELURE D’ARGENT DE CYNTHIA QU’À MES CHEVEUX NOIRS.

source: THAT'S WHY THE ENGAGEMENT SKIPPED OVER ME AND WAS PASSED ONTO SHARON...
fr_fr: C’EST POUR ÇA QU’IL A ÉTÉ FIANCÉ À SHARON ET NON À MOI...

source: JUST BECAUSE I GOT CAUGHT UP IN THE SCHEMING OF MY STEPMOTHER AND STEPSISTERS AT THE BEGINNING OF THE NOVEL!
fr_fr: SIMPLEMENT PARCE QUE JE ME SUIS RETROUVÉE MÊLÉE AUX MANIGANCES DE MA BELLE-MÈRE ET DE MA DEMI-SŒUR AU DÉBUT DE L’HISTOIRE !

source: BUT TO TERMINATE THE CONTRACT AFTER EVEN THE OPENING DAY GIVEAWAYS ARE ALREADY PRODUCED..
fr_fr: MAIS ROMPRE LE CONTRAT AVANT MÊME QUE LES ÉCHANTILLONS GRATUITS PRÉVUS POUR L’OUVERTURE N’AIENT ÉTÉ FABRIQUÉS...

source: WHERE ARE YOU OFFICERS FROM?
fr_fr: D’OÙ VIENNENT VOS AGENTS ?

source: TREMBLE
fr_fr: BRRR

source: ANYWAY, IF I JUST SIT AND DO NOTHING, I REALLY WILL DIE LIKE THE CHARACTER IN THE BOOK.
fr_fr: BON, SI JE RESTE ASSISE À NE RIEN FAIRE, JE VAIS FINIR PAR MOURIR COMME MON PERSONNAGE.

source: YOU...!
fr_fr: TOI...!

source: ph
fr_fr: tél :

source: NO NEED TO GET ON THE BAD SIDE OF THE DAO OVER THIS.
fr_fr: INUTILE DE SE METTRE LE BUREAU DU PROCUREUR À DOS.

source: HOW MUCH LONGER WILL YOU WAIT HERE?
fr_fr: TU NE VAS PAS PASSER LA NUIT ICI !

source: HE WAS BEING SO BLATANTLY FISHY THAT HE THREW ME OFF SCENT.
fr_fr: IL AVAIT L’AIR SI SUSPECT QU’IL M’A INDUIT EN ERREUR.

source: Localization Manager:
fr_fr: Chargée de projet de traduction :

source: I'M RECOVERING WELL, DUE TO MY MOTHER'S DILIGENT CARE.
fr_fr: JE ME REMETS BIEN, GRÂCE AUX SOINS DE MA MÈRE DÉVOUÉE.

source: I DON'T REALLY FEEL ANYTHING AT ALL...
fr_fr: JE N’AI AUCUNE RÉACTION...

source: RISE
fr_fr: S’ÉLÈVE

source: I AM ITS FOUNDATION.
fr_fr: JE SUIS SA FONDATRICE.

source: YOU SAID THAT SIX TIMES ALREADY, YOU DEVIL!
fr_fr: C’EST LA SIXIÈME FOIS, ESPÈCE DE MONSTRE !

source: THERE WAS A CAR PARKED IN FRONT OF MINE THIS MORNING.
fr_fr: UNE VOITURE ÉTAIT GARÉE DEVANT LA MIENNE, CE MATIN.

source: I DON’T KNOW YOU?
fr_fr: AH, OUI ?

source: I DON’T HAVE TIME FOR THIS!
fr_fr: JE N’AI PAS LE TEMPS POUR CELA !

source: I HAD HEARD THAT YOU WERE IN POOR HEALTH.
fr_fr: J’AVAIS OUÏ DIRE QUE VOUS ÉTIEZ DE SANTÉ FRAGILE.

source: FINE.
fr_fr: BON.

source: SO WHAT NOW, SIR?
fr_fr: ET MAINTENANT, MONSIEUR ?

source: AND THAT WAS IT.
fr_fr: RIEN DE PLUS.

source: IF HE SAYS IT’S CLOSED, IT’S CLOSED.
fr_fr: L’AFFAIRE EST CLASSÉE.

source: NOD
fr_fr: AQUIESCE

source: STEPMOTHER...
fr_fr: MA BELLE-MÈRE...

source: MISS ADRIANNA.
fr_fr: MADEMOISELLE ADRIANNA.

source: I BUILT THIS KINGDOM.
fr_fr: J’AI BÂTI CE ROYAUME.

source: SKINNIER??
fr_fr: IL A MAIGRI ??

source: CLACK
fr_fr: TAC

source: CLENCH
fr_fr: SERRE

source: MUST IT BE NOW?
fr_fr: VRAIMENT ?

source: BULLSHIT.
fr_fr: N’IMPORTE QUOI.

source: I CAN’T SLEEP AT NIGHT BECAUSE OF THE THOUGHT OF HAVING TO WAKE UP TO MORE MEETINGS KEEPS ME UP!
fr_fr: TOUTES CES RÉUNIONS QUI M’ATTENDENT LE LENDEMAIN M’EMPÊCHENT DE FERMER L’ŒIL !

source: PFFT...
fr_fr: PFFF...

source: SHE DOESN'T HAVE A DROP OF DUCAL BLOOD FLOWING WITHIN HER.
fr_fr: ELLE N’A PAS LA MOINDRE TRACE DE SANG DUCAL DANS LES VEINES.

source: TOSS
fr_fr: TAC

source: DETECTIVE JUNG!
fr_fr: INSPECTEUR JUNG !

source: LET'S
fr_fr: JE VEUX...

source: THAT'S WHY I’M OFFICIALLY GOING TO REQUEST THAT WE RE-OPEN THIS CASE.
fr_fr: JE VAIS DONC DEMANDER SA RÉOUVERTURE.

source: I'M MUWON CHOI.
fr_fr: JE SUIS MUWON CHOI.

source: STAY COMPOSED!
fr_fr: GARDE TON CALME !

source: SHAKE
fr_fr: NON

source: WE’LL HAVE TO WAIT FOR THE AUTOPSY RESULTS TO GET THE PRECISE TIME…
fr_fr: NOUS ATTENDONS LES RÉSULTATS DE L’AUTOPSIE POUR AVOIR L’HEURE EXACTE...

source: ORIGINAL BY YU-JIN
fr_fr: UNE ŒUVRE DE YU-JIN

source: WHY DO YOU EVEN CARE?!
fr_fr: MAIS QU’EST-CE QUE ÇA PEUT TE FAIRE ?!

source: I WON'T TAKE THIS SITTING DOWN!!
fr_fr: JE NE VAIS PAS ME LAISSER FAIRE !!

source: “FRICKEN’ OLD?” “TANTRUM?”
fr_fr: « ASSEZ GRAND ? » « PIQUER UNE CRISE ? »

source: KEEP WALKING.
fr_fr: NE T’ARRÊTE PAS.

source: SERIOUSLY…
fr_fr: FRANCHEMENT...

source: ARE WE NOT TAUGHT, MY QUEEN, TO HONOR THE ELDERLY?
fr_fr: NE DEVONS-NOUS PAS, MA REINE, RESPECTER NOS AÎNÉS ?

source: PFFT!
fr_fr: PFFF !

source: DIDN’T YOU SAY YOU WERE FEELING UNEASY ABOUT THIS SPOT BEFORE?
fr_fr: N’AS-TU PAS DIT QUE TU N’AIMAIS PAS CET ENDROIT ?

source: SHAAAA
fr_fr: PSCHT

source: OF COURSE!
fr_fr: BIEN ENTENDU !

source: THIS IMMEDIATELY TURNED THE SUICIDE INTO AN OPEN, MURDER CASE.
fr_fr: CETTE AFFAIRE DE SUICIDE DEVINT UNE AFFAIRE DE MEURTRE.

source: PLEASE, ACCEPT THIS.
fr_fr: JE VOUS EN PRIE, ACCEPTEZ-LE.

source: WHY DO YOU HATE ME SO MUCH?
fr_fr: POURQUOI ME HAIS-TU À CE POINT ?

source: YOUR WORK, YOUR HAPPINESS, AND YOURSELF!
fr_fr: TON TRAVAIL, TON BONHEUR, TA VIE !

source: BUT, NOT...
fr_fr: MAIS À PRÉSENT...

source: FWIP
fr_fr: FFFT

source: IT IS A VERY DIFFICULT ITEM TO ACQUIRE, ARE YOU SURE YOU WISH TO GIVE THIS TO CYNTHIA?
fr_fr: C’EST UN OBJET TRÈS RECHERCHÉ. ÊTES-VOUS SÛRE DE VOULOIR EN FAIRE CADEAU À CYNTHIA ?

source: DON'T YOU FIND THE WALL PAPER UGLY?
fr_fr: LE PAPIER PEINT EST MOCHE, NON ?

source: HOW COULD I FACE MY GRANDCHILDREN, MADAM, KNOWING THAT I HAVE FAILED IN MY DUTY TO PROTECT THE KINGDOM?
fr_fr: COMMENT POURRAIS-JE LEUR FAIRE FACE SACHANT QUE J’AI FAILLI À MON DEVOIR DE PROTÉGER LE ROYAUME ?

source: I...
fr_fr: JE...

source: SKRR...
fr_fr: CRRR

source: STARTLED
fr_fr: SURSAUT

source: KRYAAAH!
fr_fr: YAAAAH !

source: …THEY FOUND THE VICTIM’S PHONE.
fr_fr: ... ILS TROUVÈRENT LE TÉLÉPHONE DE LA VICTIME.

source: YOU AREN'T THINKING OF SEDUCING THE PRINCE, ARE YOU?
fr_fr: TU NE T’IMAGINES PAS SÉDUIRE LE PRINCE, TOUT DE MÊME ?

source: THIS IS...?
fr_fr: QU’EST-CE...?

source: MISS ADRIANNA, HAVE YOU AWOKEN...?
fr_fr: MADEMOISELLE ADRIANNA, VOUS ÊTES RÉVEILLÉE...?

source: I WAS CRAVING SO MUCH...
fr_fr: JE MOURAIS DE FAIM...

source: THIS PLACE DOESN’T FEEL SAFE.
fr_fr: NOUS NE SOMMES PAS EN SÉCURITÉ.

source: GENTLE
fr_fr: CARESSE

source: YURAE LEE ASKED ME TO GIVE THIS TO YOU...
fr_fr: DE MADAME YURAE LEE...

source: WHAT A WASTE...
fr_fr: QUEL GÂCHIS...

source: IT'S TIME ALREADY?
fr_fr: DÉJÀ ?

source: NO.
fr_fr: NON.

source: CHU
fr_fr: SMACK

source: THERE HAS TO BE SOMEONE WHO WILL HELP ME!
fr_fr: QUELQU’UN SERA FORCÉMENT PRÊT À M’AIDER !

source: AND AREN’T I THE HIGHEST PERSON IN THE LAND?
fr_fr: NE SUIS-JE PAS À LA TÊTE DE CE PAYS ?

source: RIGHT-
fr_fr: OUI-

source: THEN, THEODORE ACCEPTS HIS NEW TITLE AS THE DUKE OF CRESCENTE,
fr_fr: PUIS IL ACCEPTE SON NOUVEAU TITRE DE DUC DE CRESCENTE

source: TO DIE EARLY WITHOUT EXPERIENCING ALL THE GLORIES OF THE GOLDEN LIFE!
fr_fr: DE MOURIR JEUNE SANS PROFITER DES JOIES DE CETTE VIE DORÉE.

source: IS IT NOT RECORDED THAT SHE WAS NINE AND TWENTY?
fr_fr: NE RACONTE-T-ON PAS QU’ELLE AVAIT 29 ANS ?

source: <RAMONA'S TALE>
fr_fr: <LE CONTE DE RAMONA>

source: SHE DROVE OUT MY BROTHER, FORCING HIM TO ATTEND A BOARDING SCHOOL,
fr_fr: ELLE A ÉVINCÉ MON FRÈRE EN L’ENVOYANT DE FORCE DANS UN PENSIONNAT

source: THE MEDIA’S GOING TO BE ALL OVER THIS.
fr_fr: ÇA SERA DANS TOUS LES MÉDIAS.

source: DIG IN.
fr_fr: VAS-Y.

source: ARE YOU SURE IT'S THE HOUSE?
fr_fr: TU ES SÛR QUE C’EST LA MAISON ?

source: OH MY, MISS SHARON?
fr_fr: OH, MADEMOISELLE SHARON ?

source: OH HO HO~
fr_fr: HO HO HO~

source: PUT YOUR HAND ON YOUR CHEST AND THINK QUIETLY.
fr_fr: POSE LA MAIN SUR TA POITRINE ET PRENDS LE TEMPS DE RÉFLÉCHIR.

source: YOU WOULD DO WELL TO REMEMBER THIS BEFORE INSINUATING THAT I AM ANYTHING LESS.
fr_fr: VOUS FERIEZ MIEUX DE VOUS EN SOUVENIR AVANT DE FAIRE DES INSINUATIONS.

source: MISS SHARON...
fr_fr: MADEMOISELLE SHARON...

source: AND THE POWER OF THE CHALICE OF CONQUEST,
fr_fr: ET AU POUVOIR DU CALICE DE LA VICTOIRE,

source: AROUND 13:20 TODAY, THEY FOUND A DEAD BODY AT MIARI HILLS IN SEONGBUK DISTRICT.
fr_fr: VERS 13H20, UN CORPS A ÉTÉ DÉCOUVERT DANS L’ARRONDISSEMENT DU SEONGBUK.

source: MORE MEETINGS!
fr_fr: ENCORE DES RÉUNIONS !

source: HAVE I REALLY...
fr_fr: ME SUIS-JE VRAIMENT...
